ДипломДубль/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ДипломДубль/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ТипСуммы</types>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДипломДубль/src/AccumulationRegisters/ВКМ_ПродажиПоАктам/ВКМ_ПродажиПоАктам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПродажиПоАктам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДипломДубль/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ПродажиПоАктам</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДипломДубль/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Функция ВыполнитьСерверныйКод(Период) Экспорт    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент,
		|	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот) КАК СуммаКОплатеОборот,
		|	&Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВыполненоРабот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор,
		|	Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВКМ_ПродажиПоАктамОбороты.СуммаОборот) КАК СуммаОборот,
		|	ВКМ_ПродажиПоАктамОбороты.Номенклатура КАК Номенклатура,
		|	ВКМ_ПродажиПоАктамОбороты.Контрагент КАК Контрагент,
		|	ВКМ_ПродажиПоАктамОбороты.Договор КАК Договор
		|ПОМЕСТИТЬ втАкты
		|ИЗ
		|	РегистрНакопления.ВКМ_ПродажиПоАктам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			(Контрагент, Договор) В
		|					(ВЫБРАТЬ
		|						Работы.Клиент,
		|						Работы.Договор
		|					ИЗ
		|						ВыполненоРабот КАК Работы)
		|				И Номенклатура = &Номенклатура) КАК ВКМ_ПродажиПоАктамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ПродажиПоАктамОбороты.Номенклатура,
		|	ВКМ_ПродажиПоАктамОбороты.Контрагент,
		|	ВКМ_ПродажиПоАктамОбороты.Договор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбработкаЗаказовОбороты.Контрагент КАК Контрагент,
		|	ОбработкаЗаказовОбороты.Договор КАК Договор,
		|	ОбработкаЗаказовОбороты.Заказ КАК Заказ
		|ПОМЕСТИТЬ втЗакзы
		|ИЗ
		|	РегистрНакопления.ОбработкаЗаказов.Обороты(
		|			ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -12),
		|			&КонецПериода,
		|			,
		|			(Контрагент, Договор) В
		|				(ВЫБРАТЬ
		|					Работы.Клиент,
		|					Работы.Договор
		|				ИЗ
		|					ВыполненоРабот КАК Работы)) КАК ОбработкаЗаказовОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОбработкаЗаказовОбороты.Контрагент КАК Контрагент,
		|			ОбработкаЗаказовОбороты.Договор КАК Договор,
		|			МАКСИМУМ(ОбработкаЗаказовОбороты.Заказ.Дата) КАК ЗаказДата
		|		ИЗ
		|			РегистрНакопления.ОбработкаЗаказов.Обороты(
		|					ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -12),
		|					&КонецПериода,
		|					,
		|					(Контрагент, Договор) В
		|						(ВЫБРАТЬ
		|							Работы.Клиент,
		|							Работы.Договор
		|						ИЗ
		|							ВыполненоРабот КАК Работы)) КАК ОбработкаЗаказовОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОбработкаЗаказовОбороты.Контрагент,
		|			ОбработкаЗаказовОбороты.Договор) КАК МаксимСроки
		|		ПО ОбработкаЗаказовОбороты.Контрагент = МаксимСроки.Контрагент
		|			И ОбработкаЗаказовОбороты.Договор = МаксимСроки.Договор
		|			И ОбработкаЗаказовОбороты.Заказ.Дата = МаксимСроки.ЗаказДата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыполненоРабот.Договор КАК Договор,
		|	ВыполненоРабот.Клиент КАК Клиент,
		|	ВыполненоРабот.СуммаКОплатеОборот - ЕСТЬNULL(втАкты.СуммаОборот, 0) КАК СуммаКОплате,
		|	ЕСТЬNULL(втАкты.Номенклатура, ВыполненоРабот.Номенклатура) КАК Номенклатура,
		|	втЗакзы.Заказ КАК Заказ
		|ИЗ
		|	ВыполненоРабот КАК ВыполненоРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАкты КАК втАкты
		|		ПО ВыполненоРабот.Клиент = втАкты.Контрагент
		|			И ВыполненоРабот.Договор = втАкты.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗакзы КАК втЗакзы
		|		ПО ВыполненоРабот.Клиент = втЗакзы.Контрагент
		|			И ВыполненоРабот.Договор = втЗакзы.Договор
		|ГДЕ
		|	ВыполненоРабот.СуммаКОплатеОборот - ЕСТЬNULL(втАкты.СуммаОборот, 0) > 0";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Номенклатура", Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоРеализация = Выборка.Количество();     
	Счетчик=0; 
	Результат = "";
	Пока Выборка.Следующий() Цикл  
		Счетчик = Счетчик+1;           
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = КонецМесяца(Период);
		НовыйДокумент.Контрагент = Выборка.Клиент;
		НовыйДокумент.Договор = Выборка.Договор;
		НовыйДокумент.Комментарий = СтрШаблон("Создано обработкой в %1",ТекущаяДатаСеанса());   
		НовыйДокумент.Организация = Константы.ВКМ_ОсновнаяОрганизация.Получить();    
		НовыйДокумент.Основание = Выборка.Заказ;    
		НовыйДокумент.СуммаДокумента = Выборка.СуммаКОплате;     
		//@skip-check undefined-variable
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокумент.ВыполнитьАвтозаполнение();
		
		Если НовыйДокумент.ПроверитьЗаполнение() Тогда
		    НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
			Результат = Результат + СтрШаблон("Создан документ %3 для контрагента %1 по договору %2",
							Выборка.Клиент, Выборка.Договор, НовыйДокумент)+ "
							|";
		КонецЕсли; 
		
		//@skip-check undefined-variable
		ДлительныеОперации.СообщитьПрогресс(Счетчик / КоличествоРеализация * 100);
	КонецЦикла;
	

	Возврат Результат;
	
КонецФункции	
# КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
